app/controllers/api/v1/product_controller.rb

SELECT `products`.* FROM `products`
---
     def index
       products = Product.all