app/controllers/api/v1/varients_controller.rb

SELECT `varients`.* FROM `varients`
---
      def show
        varients = Varient.all