app/models/product_varient.rb

SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
SELECT `varients`.* FROM `varients` WHERE `varients`.`id` = 1 LIMIT 1
---
    def create_product_varient(product_id, varient_id)
      begin
        product = Product.find_by(id: product_id)